'''Квадраты отсротированного массива
Дан целочисленный массив чисел, отсортированных в неубывающем порядке, 
верните массив квадратов каждого числа, отсортированного в неубывающем порядке.'''

try:
    nums = list(map(int, input().split(',')))
except ValueError:
    nums = []

def num2s(nums):
    return sorted([x**2 for x in nums])

print(num2s(nums))

tests = [
    ([-4,-1,0,3,10],[0, 1, 9, 16, 100]),
    ([-10, -2, 0, 0, 1, 1],[0,0,1,1,4,100]),
    ([], []),
    ([1], [1]),
    ([-1,1], [1,1]) 
]

for x in tests:
    v = num2s(x[0])
    assert v == x[1], f'error in test: {x}, {v}'